[{"name":"Allram Hasel Alte Reben Kamptal Reserve Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":95.0,"notes":"#70"},{"name":"Allram Trocken Kamptal Strassertaler Gruner Veltliner 2013","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"This wine is the quintessence of a typical Grüner Veltliner of our wine growing region. Delicate peppery aroma with refreshing citrus notes on the pallet, spicy, charming and light, clear pepperiness."},{"name":"Berger Lossterrassen Kremstal DAC Gruner Veltliner 2014","grape":null,"region":"Kremstal, Austria","variety":"White Wine","rating":93.0,"notes":"Some \"exotic\" aromas over the classic loess profile; super peppery and charred, pulverized stone and gravelly tannin."},{"name":"Berger Lossterrassen Kremstal DAC Gruner Veltliner 2015","grape":null,"region":"Kremstal, Austria","variety":"White Wine","rating":93.0,"notes":"Some \"exotic\" aromas over the classic loess profile; super peppery and charred, pulverized stone and gravelly tannin."},{"name":"Berger Lossterrassen Kremstal DAC Gruner Veltliner 2017","grape":null,"region":"Kremstal, Austria","variety":"White Wine","rating":91.0,"notes":"To affirm that GV belongs among the finest grapes from which white wine is made, and that it should be uniquely cherished for its particular gifts, the winemaker prefers to present this everyday wine, the kind of wine a careful caring grower can make in any good vintage and that sells for the price of a hamburger, not filet mignon. One swirl, one sniff, one taste, and the doors swing open, and GV is welcomed into the elite. Even this simple wine? Especially this simple wine."},{"name":"Brundlmayer Alte Reben Gruner Veltliner 2012","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"Rich and generous from the beginning, some forest honey and rye bread, but also rich fruit length to Steinobst, creamy, inviting and quite flowing; With all the strength but also fine lines, surprisingly animated and fresh, muscular and tightly interwoven, works really well on the palate and has a long pepppery finish."},{"name":"Brundlmayer Alte Reben Gruner Veltliner 2013","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"Flowers & fresh (exotic) fruit (citrus and pineapple); apples and pears some peppery spice & just a hint of toasty & nutty aromas , on the palate dry following through with mouthwatering fruit also grapefruit, pineapple, melon, lots of minerals and some peppery spice, concentrated, with a good grip, and harmonically integrating acidity, a quite subtle wine well balanced showing typical minerals and spice in the long after taste."},{"name":"Brundlmayer Alte Reben Gruner Veltliner 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"The nose shows flowers and fresh, exotic fruit (citrus and pineapple), apples, pears, some peppery spice and just a hint of toasty and nutty aromas. On the palate, this wine is dry and offers notes of grapefruit, pineapple, melon, and peppery spice. The wine is concentrated, with good grip, and has nicely-integrated acidity. Quite subtle and well-balanced, showing typical minerality and spice in the long finish."},{"name":"Brundlmayer Alte Reben Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"Flowers & fresh (exotic) fruit (citrus and pineapple); apples and pears some peppery spice & just a hint of toasty & nutty aromas , on the palate dry following through with mouthwatering fruit also grapefruit, pineapple, melon, lots of minerals and some peppery spice, concentrated, with a good grip, and harmonically integrating acidity, a quite subtle wine well balanced showing typical minerals and spice in the long after taste."},{"name":"Brundlmayer Alte Reben Gruner Veltliner 2017","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"An enchanting bouquet of honeysuckle, Reine Claude plum, pear, exotic nuances and herbal spice over discreetly toasty background. Initially mild and creamy on the palate, then surprisingly concentrated and powerful while simultaneously remaining fresh and appetizing. Juicy, full body with a taut spine of acid. Concentrated and spicy with still youthful tannins on the long finish. An exemplary Langenlois Grüner Veltliner from a sunny vintage."},{"name":"Brundlmayer Kamptaler Terrassen Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"Flowery, delicate lime fruit, apple and pineapple with a hint of herbs, spice and yeast, soft at first taste, despite its lively acidity, then straightforward, fresh on the palate, sappy fruit, mineral nuances, good structure and balance, medium body and fine minerals in the spicy finish. Classic for Kamptal Veltliner."},{"name":"Brundlmayer Kamptaler Terrassen Gruner Veltliner 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"Flowery, delicate lime fruit, apple and pineapple with a hint of herbs, spice and yeast, soft at first taste, despite its lively acidity, then straightforward, fresh on the palate, sappy fruit, mineral nuances, good structure and balance, medium body and fine minerals in the spicy finish. Classic for Kamptal Veltliner."},{"name":"Brundlmayer Kamptaler Terrassen Gruner Veltliner 2017","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":91.0,"notes":"Well matured, green walnut, elder flowers and citrus fruit, some cereals, nuts and cornflakes, very dry and fresh with quite some body and structure, also hints of leafy and peppery spice, rye bread and malt. A light bouquet of fresh green grapes, pome and stone fruit, classic Kamptal loss type with some mineral backbone mouthwatering finish."},{"name":"Brundlmayer Kamptaler Terrassen Riesling 2012","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"Bright, clear straw yellow with green reflections. Subtle aromas of stone fruit, limes and mandarins. Very fresh and flavorful, with even flowers and herbs on the palate. Medium bodied and very balanced with a pleasant minerality. A solid structure and good length."},{"name":"Brundlmayer Kamptaler Terrassen Riesling 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"Very pure, attractive primary fruit (classic apricot & peach and also tangerine & citrus), flowery elements some herbs and green tea, still a bit yeasty, yet open at the front, with a hint of minerals and flowery aroma , straightforward and quite fresh on the palate again with surprising fruit, medium body, great minerals, perfectly balanced structure, showing good potential."},{"name":"Brundlmayer Kamptaler Terrassen Riesling 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"Very pure, attractive primary fruit (classic apricot, peach, tangerine and citrus), flowery elements some herbs and green tea, still a bit yeasty, yet open at the front, with a hint of minerals and flowery aroma , straightforward and quite fresh on the palate again with surprising fruit, medium body, great minerals, perfectly balanced structure, showing good potential."},{"name":"Brundlmayer Kamptaler Terrassen Riesling 2016","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":91.0,"notes":"Very pure, attractive primary fruit (classic apricot, peach, tangerine and citrus) as well as flowery elements, some herbs and green tea. Still a bit yeasty, yet open at the front, with a hint of mineral and floral aromas. Straightforward and quite fresh on the palate with surprising fruit, medium body, great minerality and balanced structure."},{"name":"Brundlmayer Sekt Extra Brut","grape":null,"region":"Kamptal, Austria","variety":"Sparkling & Champagne","rating":91.0,"notes":"Light pale yellow; fine and persistent mousse; pure elegant nose, fragrant fruit (apple, quinces, hay flowers and white berries, lemon peel, accompanied by pleasant toasty, yeasty and mineral aromas, quite complex, crisp yet also slightly creamy on the palate with again persisting fruity and mineral elements; fresh but well integrated acidity , mineral and spicy (peppery) nuances in the end."},{"name":"Brundlmayer Vincent's Spiegel Gruner Veltliner 2013","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"It's doughy, mineral and powerful; amazingly high-toned for its mass; stony, but smooth stone, not gravel and not pulverized; toasty, mint and pink peppercorns; very Burgundian."},{"name":"Brundlmayer Vincent's Spiegel Gruner Veltliner 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"It's doughy, mineral and powerful; amazingly high-toned for its mass; stony, but smooth stone, not gravel and not pulverized; toasty, mint and pink peppercorns; very Burgundian."},{"name":"Brundlmayer Zobinger Heiligenstein Lyra Riesling 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"The wine is named for the Y-shaped trellising system that increases canopy, thus shading the grapes and increasing photosynthesis. It also “looks like the vine is throwing its arms up toward the sun,” says Willi (poetically!), who adds, “And it shows that you don’t need old vines to give great Riesling.” I show you the ’14 basically for-the-record, as it won’t be released until 2016, not to mention any sensible person would jump on the grandiose 2013. I’m starting to sense that Lyra is a music that’s begun to write itself. Willi’s early goal was to show the utmost rapture of fruit, as an alpha to the omega of the Alte Reben and its darker gravitas. But for the last three vintages, Lyra has become almost overwhelmingly beautiful. It isn’t just fruit any more, and what began as a rapture has changed to a kind of apotheosis of fruit toward a gleaming and complicated divinity. The wine remains ecstatic, but these things are never earned easily. ’13 is graceful and massive, dense and weightless, a whirligig of complexity in which a hundred elements glide in an esoteric dance, moving quickly, stepping lightly; it has the focus and the beatific glow of Alzinger (and his wines!), somehow both serene and hyperactively intricate. The ’14 Lyra, which we’ll see in January 2016, is really green and herbal; it has its usual beaming countenance but in a different key than usual, like a parfait of each green leaf."},{"name":"Brundlmayer Zobinger Heiligenstein Lyra Riesling 2018","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":95.0,"notes":"Immediately sets off fireworks of bright fruit – first the scent of white flowers, but then acacia honey, yuzu and white peaches set the tone; classy and expressive in each phase, already strikingly charming. Similar impressions in the palate profile: a core of sweet fruit, gripping and puristic, the bright fruit follows through with a lot of finesse and vibrant freshness; flows with growing complexity across the palate but the playful fruit remains consistently present. Excellent breeding, very long with great potential."},{"name":"Brundlmayer Zobinger Heiligenstein Lyra Riesling 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":95.0,"notes":"A special cuvée from only lyre-trained vines, showing in Willi’s words that “You don’t need old vines to give great Riesling.” He adds, “The greater leaf surface gives increased photosynthesis, protects the grapes, and besides, it looks like the vine is throwing its arms up toward the sun.” Comparing Lyra with Alte Reben is an abidingly fascinating exercise. In hot years Lyra often prevails, when A.R. gets too ripe. In most years it’s lovely to look at what I call “above ground flavors” (in Lyra) versus “below ground flavors” (in A.R.), but this doesn’t always mean the Lyra is fruity. Often it is quite herbal—this is, after all, Heiligenstein. This ’15 shows a superb, high-wire dance of sweet green and sweet peach, a real rapture of flavor. But not only that. It is a being of mature, intelligent gaiety, rapturous but not boisterous, incandescent but not sloppy."},{"name":"Brundlmayer Zobinger Heiligenstein Riesling 2016","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"The entry to a lofty world of greatness, this “basic” wine from a truly great Riesling vineyard.  The ’16 emphasizes a mid-range, toasted nutmeg and cinnamon, trumpet mushrooms just as they start to caramelize in the pan; the top notes are a bit nebulous but the mineral is more tangible. Lovely now, this wine is very much en-route. "},{"name":"Domane Wachau Federspiel Terrassen Gruner Veltliner 2010","grape":null,"region":"Austria","variety":"White Wine","rating":87.0,"notes":"Bright straw yellow, inviting and open on the nose with aromas of white pepper, gooseberry and hints of yellow apple. Medium bodied with a crisp acidity, very balanced and spicy finish. A typical Grüner Veltliner at Federspiel level, subtle and very racy.  "},{"name":"Domane Wachau Federspiel Terrassen Gruner Veltliner 2012","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"#90"},{"name":"Domane Wachau Federspiel Terrassen Gruner Veltliner 2014","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":89.0,"notes":"Enticing aromas of white pepper, gooseberry and hints of ripe apple. Medium bodied with a crisp acidity, very balanced and spicy in the finish. A typical Grüner Veltliner at Federspiel level, subtle and very racy. "},{"name":"Domane Wachau Federspiel Terrassen Gruner Veltliner 2015","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":91.0,"notes":"Bright greenish yellow; offering distinctive aromas on the nose of golden delicious apple, white pepper, some lychee and delicate herbal notes, hints of exotic fruits; medium bodied with a crisp acidity, very harmonious, juicy fruits and spicy in the finish. A characteristic Federspiel, balanced and very typical."},{"name":"Domane Wachau Federspiel Terrassen Gruner Veltliner 2016","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":90.0,"notes":"#68"},{"name":"Domane Wachau Federspiel Terrassen Riesling 2014","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":90.0,"notes":"Fresh, clear straw yellow with green reflections; present and pronounced on the nose, ripe aromas of white peach, apricot and delicate grapefruit, hints of exotic fruit; stone fruit aromas on the palate with an elegant structure; very fresh, crisp and well balanced by a great acidity and dense fruit with a long finish."},{"name":"Domane Wachau Federspiel Terrassen Riesling 2015","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":93.0,"notes":"Crystal clear straw yellow with green reflections; present and pronounced on the nose, ripe stone fruit, delicate citrus, hints of exotic fruit; on the palate juicy apricot, white peach and subtle hints of quince; an elegant structure; very fresh, crisp and well balanced by a great acidity and a dense fruit; long finish! "},{"name":"Domane Wachau Federspiel Terrassen Riesling 2016","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":92.0,"notes":"This wine is crystal clear and straw-yellow with green highlights. Present and pronounced on the nose this wine displays ripe stone fruit, delicate citrus, and hints of exotic fruit. On the palate there are flavors of juicy white peach and subtle hints of lychee. This wine is well balanced by a refined structure, very fresh, crisp and plush acidity."},{"name":"Domane Wachau Smaragd Achleiten Gruner Veltliner 2009","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"This exemplary Smaragd exhibits finesse and complexity and has a mineral structure. This extraordinary wine develops slowly; decanting is recommended."},{"name":"Domane Wachau Smaragd Achleiten Gruner Veltliner 2012","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":90.0,"notes":"Intense straw yellow with golden highlights. Expressive on the nose with pronounced notes of spice, white pepper, tobacco, exotic fruits like mango, offering a pronounced mineral character. The enticing aromas are generous and playful. Tightly woven, the crisp, yet perfectly balanced acidity lingers in the mineral, almost salty, long finish."},{"name":"Domane Wachau Smaragd Achleiten Gruner Veltliner 2014","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":92.0,"notes":"Expressive on the nose with aromas of white pepper and mango, offering a pronounced mineral character. The enticing aromas are generous and playful. Tightly woven. The crisp, yet perfectly balanced acidity lingers in the mineral, almost salty, long finish."},{"name":"Domane Wachau Smaragd Terrassen Gruner Veltliner 2011","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"Bright straw yellow. Open and playful on the nose with aromas of white pepper, some tobacco and exotic fruits. The refreshing acidity pairs with a full body and a medium alcohol level. Spicy white pepper and a hint of fresh herbs on the palate."},{"name":"Domane Wachau Smaragd Terrassen Gruner Veltliner 2013","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":91.0,"notes":"#85"},{"name":"Freie Weingartner Smaragd Trocken Wachau Terassen Gruner Veltliner 2006","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"Bright straw yellow in color. An open and inviting bouquet, subtle fruitiness with hints of white pepper, tobacco and mellow nutty aromas. On the palate powerful with exciting, concentrated fruit (pear) with hints of acacia. The alcohol, acidity and structure of the wine are perfectly balanced, a wine with a long finish. Grüner Veltliner Smaragd is a perfect accompaniment to fried fish dishes or fish with creamy sauces but also to fried meat (Cordon blue, fried chicken) and a wide variety of poultry."},{"name":"Glatzer St Laurent 2013","grape":null,"region":"Austria","variety":"Red Wine","rating":90.0,"notes":"Fruity and elegant with spicy sour cherry flavors."},{"name":"Heidi Schrock Muscat 2004","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"\"The 2004 Muscat might seem misnamed, when one learns it is 40% Sauvignon Blanc (with another 40% Gelber Muskateller and 20% Ottonel). But there is a loophole, because an old, still officially accepted name in Austria for Sauvignon is \"Gruner Muskateller.\" The aromas of grapefruit, yellow plum, apricot, mint and black pepper simply soar from a glass of this wine, so hold on to your hat. The palate is perfectly judged in its balancing of an unusual degree of gloss and creaminess for a Sauvignon with vivacious acids, with the overall effect managing to be both enveloping and invigorating. This excellent value wine fills your mouth with flowers, resinous herbs, citrus and pit fruits, and the finish is at once gloriously juicy, endlessly refreshing, and positively sizzling with citrus zest, concentrated pit fruit and pungent herbal notes.\""},{"name":"Heidi Schrock Weissburgunder 2004","grape":null,"region":"Austria","variety":"White Wine","rating":92.0,"notes":"Heidi's were unique Pinot Blancs, but 2000 announced a fundamental change in style.  They used to be correct enough, shellfishy, appley and leesy, but they sometimes tasted  as though a rogue gene snuck in carrying mimosa-blossom scents that took you to  another place entirely, not \"northern\" and vivid but rather cozier and more murmuring  and buttery. \"That was cask-aging,\" says Heidi. Lately she has been emphasizing batonnage and trying to get the wines more compact and dense. Pacific oysters in a glass! Plus the merest (and loveliest) hint of RS, and even a suggestion of Sauvignon Blanc in the finish. By the way, all of Heidi's whites in 2004 have a teensy bit of RS, which does them nothing but good. If I hadn't told you you wouldn't have known, but wondered why the wines were so gol-danged likeable; maize and corn notes, very racy and very ripe; less plump and more vertical then the `03, despite its high alc.  "},{"name":"Heidi Schrock Weissburgunder 2006","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"ELEGANCE: delicate Burgundian bouquet, elegant fruit, mineral structure, multi-layered "},{"name":"Heinrich Red 2015","grape":null,"region":"Neusiedlersee, Austria","variety":"Red Wine","rating":90.0,"notes":"RED showcases the enormous strides made in Austrian red wine and exhibits the quality of its native red grape varieties. Zweigelt serves as the wine’s base, providing soft and juicy red-berried fruit while notes of tobacco and spice come from Blaufränkisch. A small percentage of St. Laurent lends floral aromas and refreshing acidity. "},{"name":"Heinrich Red 2017","grape":null,"region":"Neusiedlersee, Austria","variety":"Red Wine","rating":90.0,"notes":"RED showcases the enormous strides made in Austrian red wine and exhibits the quality of its native red grape varieties. Zweigelt serves as the wine’s base, providing soft and juicy red-berried fruit while notes of tobacco and spice come from Blaufränkisch. A small percentage of St. Laurent lends floral aromas and refreshing acidity.   "},{"name":"Hermann Moser Gebling Gruner Veltliner 2012","grape":null,"region":"Kremstal, Austria","variety":"White Wine","rating":91.0,"notes":"Bright yellow color.  Exotic fruits with pineapple and lychee, with hints of stone fruits on the nose. "},{"name":"Hermann Moser Karmeliterber Gruner Veltliner 2013","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"Bright with hints of gold color. Stone fruits, golden delicious apple and pear with a hint of fresh cut grass on the nose. Palate is fresh and bright with the typical peppery and spicy flavors found in Grüner Veltliner. Great acidity and structure.  "},{"name":"Hiedler Langenlois Riesling 2017","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"The 2017 is smoky and angular, funky plum blossom and balsam, woodruff and iron; in other words as unique as always!"},{"name":"Hiedler Loss Gruner Veltliner 2007","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"\"Rich and ripe, with flavors of peach, Fuji apple and hints of marzipan. The precise finish of glazed apricot and citrus is long and satisfying. Drink now through 2013.\" 90 Points"},{"name":"Hiedler Loss Gruner Veltliner 2018","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"The wine has a fruity entrée with notes of white flowers, apple, green pears, subtle nuances of herbs; fine acidity, bright fruit character, some mirabelle, yellow apple, beautiful texture, very versatile food companion."},{"name":"Hiedler Loss Gruner Veltliner 2019","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"The wine has a fruity entrée with notes of white flowers, apple, green pears, subtle nuances of herbs; fine acidity, bright fruit character, some mirabelle, yellow apple, beautiful texture, very versatile food companion."},{"name":"Hiedler Thal Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"It is the classic Hiedler wine showing the juicy Viognier side of Gruner Veltliner also showing nuances of roasted red peppers."},{"name":"Hiedler Thal Gruner Veltliner 2017","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":92.0,"notes":"Usually this is GV rendered as Semillon, with a little hot paprika shaken into the mix. The ’17 is certainly a big smoky voodoo beast, real wicca-juice. It’s like you’re about to leave home for a few weeks and you cooked all the veggies you had, especially the peppers and eggplant, with cinnamon and nutmeg, and then you sucked on a Ricola eucalyptus candy, and then you top-applied Timut pepper, paprika and marjoram to your veggie-mess. And then you served up the joyful slop, wrecked your shirt, licked your lips, licked your partner’s lips, and let someone else wash the dishes."},{"name":"Hiedler Urgestein Riesling 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":91.0,"notes":"Ripe yellow peach, a touch of apricot, orange zest and honey. Juicy, elegant, delicate fruit-sweetness, nuances of tropical fruit, elegant acidity, and a salty finish. This wine has good aging potential."},{"name":"Hirtzberger Gruner Veltliner Federspiel Spitzer Rotes Tor 2003","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"\"Classic Rotes Tor in the way it encases its ripeness in a firmly minerally package, this is powerful, even muscular. In this hot vintage, the ripely luscious fruit seems to exist purely as puppy fat, not at all detracting fromthe deeper underlying character of the wine. A hue Federspiel, beautiful in its terroir expression.\""},{"name":"Hirtzberger Gruner Veltliner Rotes Tor Smaragd 2005","grape":null,"region":"Austria","variety":"White Wine","rating":94.0,"notes":"\"Harvested November 8-10 from the steepest terraces of the Rotes Tor (adjacent to Singerriedel), Hirtzberger's 2005 Gruner Veltliner Smaragd Rotes Tor smells of sweet pea, citrus, and rhubarb. It comes onto the palate with creamy texture yet loads of juicy fruit and positively shimmering wet stone, salty mineral expression. Like its Federspeiel counterpart, this exhibits great clarity of fruit, even though one can detect accents of honey and brown spice attributable to botrytis. A brothy, rich meld of stone, spice, and fruit pours itself into a long, evocative finish that outdistances all but a handful of other Gruner Veltliner from this vintage. I would be unafraid to stash some of this in my cellar for a decade or more – indeed I would regret not doing so, and while I was at it I would track some bottles of the Federspiel as well.\""},{"name":"Hirtzberger Rotes Tor Smaragd Gruner Veltliner 2017","grape":null,"region":"Wachau, Austria","variety":"White Wine","rating":93.0,"notes":"Medium yellow, silver reflections. With a touch of meadow herbs underlaid nuances of fully ripe honeydew melon, delicate smoky-tobacco notes, notes of orange zest. Juicy, powerful, ripe yellow tropical fruit, mineral and salty, subtle honeymoon in the finish, good development potential."},{"name":"Hofer Gruner Veltliner Freiberg 2012","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"This one-of-a-kind styled Gruner Veltliner Freiberg is rich, creamy and exotic and is also juicy and lacquered."},{"name":"Hugl Gruner Veltliner (1 Liter) 2011","grape":null,"region":"Austria","variety":"White Wine","rating":87.0,"notes":"Gruner Veltliner represents about 70% of the winery's vineyards. This is an intense and concentrated wine offering pleasant citrus and grapefruit aromas, exotic tropical fruits with a hint of freshly ground white pepper. Full-bodied dry wine with a firm mineral backbone, giving it the strength of character to work well with many cuisines."},{"name":"Hugl Gruner Veltliner (1 Liter) 2013","grape":null,"region":"Austria","variety":"White Wine","rating":89.0,"notes":"This is an intense and concentrated wine offering pleasant citrus and grapefruit aromas, exotic tropical fruits with a hint of freshly ground white pepper. Full-bodied dry wine with a firm mineral backbone. "},{"name":"Juris St. Laurent 2007","grape":null,"region":"Austria","variety":"Red Wine","rating":88.0,"notes":"Sankt Laurent is a fairly rare Austrian grape varietal. It originated as a volunteer clone from Pinot Noir plants Burgundian monks brought into the country centuries ago. JURIS is one of the top Austrian wine makers of this exquisite grape and their Selection 2007 is yet another good example of their craftsmanship."},{"name":"Jurtschitsch Stein Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":91.0,"notes":"Grapefruit, salt, and wet rock, refreshing, rejuvenating and appetizing – all these attributes are found on the nose and the palate. Stone fruit completes the array of aromas. Definitely a terroir wine. The structure is compact and tightly woven while the style is cool and elegant and a fine texture coats the mouth. The Stein is playful and refreshing, yet is by no means superficial. "},{"name":"Jurtschitsch Stein Gruner Veltliner 2016","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":93.0,"notes":"#28"},{"name":"Jurtschitsch Stein Gruner Veltliner 2015","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"Grapefruit, salt, and wet rock, refreshing, rejuvenating and appetizing – all these attributes are found on the nose and the palate. Stone fruit completes the array of aromas. The structure is compact and tightly woven while the style is cool and elegant, and a fine texture coats the mouth. Playful and refreshing, but by no means superficial."},{"name":"Kracher Auslese Cuvee (375ml half-bottle) 2009","grape":null,"region":"Austria","variety":null,"rating":89.0,"notes":"Inviting flavors of fresh peach and tropical fruit on the nose. Juicy on the palate, delicate vineyard peach aromas, grapefruit zests, attractive spicyness, salty minerals, lively acidity, elegant texture."},{"name":"Kracher Auslese Cuvee (375ml half-bottle) 2010","grape":null,"region":"Austria","variety":null,"rating":88.0,"notes":"Medium golden yellow color.  Fine floral notes, quince and fresh peach flavors, juicy apple fruit. Flavors of honey melon and ripe, yellow peach on the palate, refreshing acidity, well integrated sweetness. Fine citrus fruit and salty minerals on the finish."},{"name":"Kracher Chardonnay TBA Nouvelle Vogue No. 5 (375ML) 2011","grape":null,"region":"Burgenland, Austria","variety":null,"rating":96.0,"notes":"Ripe tropical fruit notes, delicate oak spice and fudge. The palate shows off its vibrant acidity and citrus fruit characters in the finish."},{"name":"Kracher Chardonnay Trockenbeerenauslese #13 1998","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":97.0,"notes":"The 1998 Chardonnay Trockenbeerenauslese Nouvelle Vague Number 13 is Kracher's most concentrated wine from this vintage. Cedar, spices, apricots, and overripe peaches are displayed by thisfull-bodied, muscular offering. It is hugely dense, almost syrupy, with loads of jammy and jellied fruits in its round, sexy personality. This Rubenesque wine has untold quantities of fruit (mostly apricots), spices, and botrytis in its expressive, seamless flavorprofile. This harmonious, muscular and graceful wine will retain its fruit for at least 15 years, and will potentially age longer than anyone reading this article."},{"name":"Kracher Chardonnay Trockenbeerenauslese No 13 (375ml) 1998","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":97.0,"notes":"The 1998 Chardonnay Trockenbeerenauslese Nouvelle Vague Number 13 is Kracher's most concentrated wine from this vintage. Cedar, spices, apricots, and overripe peaches are displayed by this full-bodied, muscular offering. It is hugely dense, almost syrupy, with loads of jammy and jellied fruits in its round, sexy personality. This Rubenesque wine has untold quantities of fruit (mostly apricots), spices, and botrytis in its expressive, seamless flavor profile."},{"name":"Kracher Cuvee Beerenauslese (375ML half-bottle) 2012","grape":null,"region":"Burgenland, Austria","variety":null,"rating":93.0,"notes":"Bright yellow color with silver reflections. Pronounced honeyed notes over attractive aromas of ripe stone fruit, subtle spices and mineral character. Nuances of juicy yellow fruit with vibrant acidity; highly elegant and balanced with a touch of salt, leading to a lingering mandarin finish."},{"name":"Kracher Cuvee Beerenauslese (375ML half-bottle) 2013","grape":null,"region":"Burgenland, Austria","variety":null,"rating":90.0,"notes":"Bright yellow color with silver reflections. Pronounced honeyed notes over attractive aromas of ripe stone fruit, subtle spices and mineral character. Nuances of juicy yellow fruit with vibrant acidity; highly elegant and balanced with a touch of salt, leading to a lingering mandarin finish."},{"name":"Kracher Cuvee Beerenauslese (375ML half-bottle) 2015","grape":null,"region":"Burgenland, Austria","variety":null,"rating":90.0,"notes":"Bright yellow with silver reflections. Pronounced honeyed notes over attractive aromas of ripe stonefruit, subtle spices and mineral character. Nuances of juicy yellow fruit with vibrant acidity; highly elegant and balanced with a touch of salt, leading to a lingering mandarine finish. Great potential."},{"name":"Kracher Grand Cuvee Nouvelle Vague TBA No. 6 (375ML half-bottle) 2001","grape":null,"region":"Austria","variety":"Collectible","rating":94.0,"notes":"The wines from the Weinlaubenhof have long been in a class of their own. Practically no other sweet wines have reached such a high level of recognition worldwide and only a few have come close to the high ratings Kracher wines continuously receive. Around the world, Kracher has become the synonym for noble sweet wines of ultimate perfection. "},{"name":"Kracher Grand Cuvee Nouvelle Vague TBA No. 6 (375ML half-bottle) 2010","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Medium golden-yellow. A bouquet of delicate herbs and spices, with a touch of nougat over yellow fruit notes, with subtle aromas of honeyed and spiced characters. The palate is succulent with mineral characters and stone-fruit notes over vibrant acidity, leading to ripe peach flavors on the finish. This wine has a long future ahead."},{"name":"Kracher Grand Cuvee Nouvelle Vague TBA No. 6 (375ML half-bottle) 2012","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Medium golden-yellow. An explosive bouquet of juicy stone fruit and tangerines with oranges and citrus characters on the palate. Delicate herbal spice and a mineral, salty finish."},{"name":"Kracher Muskat Ottonel TBA Nummer 4 (375ML half-bottle) 1999","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":95.0,"notes":"A great pairing with steeped-kumquats with white chocolate ice cream, or with extra-matured rich hard cheese."},{"name":"Kracher Muskat Ottonel TBA Zwischen den Seen No. 2 (375ML half-bottle) 2010","grape":null,"region":"Burgenland, Austria","variety":null,"rating":94.0,"notes":"Medium gold. Subtle notes of candied orange zest, floral aromas and a touch of nutmeg. Highly juicy flavors with pleasant spice, with exotic white fruit characters supported by refreshing acidity, that leads to a touch of honeyed characters with white pepper and minerals in the finish."},{"name":"Kracher Scheurebe No 9 Trockenbeeren Auslese (375ML) 1999","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Darker golden yellow; enormously intense, yet extremely clear and spicy botrytis tones, apricot jam; red-berry fruit, rose hips, a massive wine in terms of residual sugar, with a vibrating acidity and a benchmark exotic fruit, succulent and long."},{"name":"Kracher Scheurebe TBA #10 (375ML half-bottle) 2002","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":96.0,"notes":"The Kracher Sheurebe #10 opens with medium golden yellow color. Aromas of fresh tangerine zest, red-berried characters, honeyed notes, and a highly attractive bouquet. On the palate, white tropical fruit notes, highly mineral with a salty tang on the finish. Despite the immense residual sugar value, the wine is remarkably fresh. "},{"name":"Kracher Scheurebe Trockenbeerenauslese Auslese No. 11 (375ML half-bottle) 2006","grape":null,"region":"Austria","variety":"Collectible","rating":95.0,"notes":"Medium golden yellow. Refreshing orange zest, grapefruit, lemongrass, elder flower and pineapple on the nose. The wine’s racy acid structure trims its huge residual sweetness down to a civilized scale. Fully ripe vineyard peach and delicate pineapple and citrus flavors are accompanied by abundant wet rock minerality, staining the palate on the aftertaste. A marvelous TBA with a brilliant and long future ahead of it."},{"name":"Kracher Scheurebe Trockenbeerenauslese Auslese No. 12 (375ML half-bottle) 1998","grape":null,"region":"Austria","variety":"Collectible","rating":93.0,"notes":"The gold-colored 1998 Scheurebe Trockenbeerenauslese Zwischen den Seen Number 12 has a chemical-scented nose that also displays white pepper and graham cracker aromas. Medium to full-bodied and lush, this wine offers copious layers of jellied yellow fruits in its fat, plump, yet wonderfully fresh personality. As its nose sheds its chemical notes with air, this wine offers a compote like character that reveals caramel and butterscotch flavors."},{"name":"Kracher Scheurebe Trockenbeerenauslese Auslese No. 3 (375ML half-bottle) 2012","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Extravagant bouquet of grapefruit zest, white blossom, tropical fruit aromas and herbal spice. Very elegant and compact style with fine acidity, leading to hints of salty characters and a lingering aftertaste of sweet ginger."},{"name":"Kracher Scheurebe Trockenbeerenauslese Auslese No. 3 (375ML half-bottle) 2010","grape":null,"region":"Austria","variety":"Collectible","rating":92.0,"notes":"Medium gold yellow tone. The bouquet is still restrained, with delicate herbed spice notes and fruit characters reminiscent of grape, tangerine zest and subtle smoky nuances. The palate shows yellow tropical fruit characters, and classy citrus notes and overall a superb mouthfeel. Attractive stone fruit characters with a touch of grapefruit in the aftertaste, with pleasant spice, agile style of wine with sheer drinking pleasure."},{"name":"Kracher TBA #10 Grand Cuvee (375ML half-bottle) 1998","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Kracher's 1998 Grande Cuvee Trockenbeerenauslese Nouvelle Vague Number 10 reveals hints of sweet oak in its otherwise jammy yellow fruit-dominated aromatics. This medium to full-bodied wine has abundant candied white grapes, and apples intermingled with poached pears in its peppery character. It is thick, spicy, oily-textured, and possesses an amazingly long, apricot-flavored finish."},{"name":"Kracher Scheurebe Zwischen Den Seen Trockenbeerenauslese #9 (375ML half-bottle) 2000","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":97.0,"notes":"Medium gold. Fresh Muscat grape aromas on the nose, seductive exotic and floral notes with fresh kumquat. Spicy nutmeg and white pepper characters on the finish, leading to a long and pleasantly lingering aftertaste. Magnificent varietal character."},{"name":"Kracher Traminer TBA Nouvelle Vague No. 1 (375ML) 2011","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":91.0,"notes":"The wines from the Weinlaubenhof have long been in a class of their own. Practically no other sweet wines have reached such a high level of recognition worldwide and only a few have come close to the high ratings Kracher wines continuously receive. Around the world, Kracher has become the synonym for noble sweet wines of ultimate perfection."},{"name":"Kracher Traminer TBA Nouvelle Vague No. 1 (375ML) 2015","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":92.0,"notes":"Bright golden-yellow. Bouquet of meadow herbs, delicate notes of stone fruit and lychee. The palate is fresh and vibrant, with nuances of pineapple, and tropical fruit notes on the finish, omplemented with a hint of honey in the aftertaste. Good grip. "},{"name":"Kracher Traminer TBA Nouvelle Vague No. 8 (375ML) 2010","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":95.0,"notes":"Intense golden-yellow with fine notes of rose and lychee, with attractive spiced notes. The palate is luscious and refined. Juicy stone-fruit characters; highly elegant with exceptional balance and length over mineral nuances; tastes nimble, with long cellaring potential."},{"name":"Kracher Trocken Pinot Gris 2015","grape":null,"region":"Burgenland, Austria","variety":"White Wine","rating":90.0,"notes":"Pale green-yellow. Fine fresh apple fruit, honey melon and a hint of wild herbs. On the palate juicy, elegant texture, white tropical fruit aromas, descreet acidity. Fresh citrus flavors and pleasant minerality on the finish. A multi-layered food companion.  "},{"name":"Kracher Trockenbeeren Auslese (187ML)","grape":null,"region":"Burgenland, Austria","variety":null,"rating":91.0,"notes":"The wines from the Weinlaubenhof have long been in a class of their own. Practically no other sweet wines have reached such a high level of recognition worldwide and only a few have come close to the high ratings Kracher wines continuously receive. Around the world, Kracher has become the synonym for noble sweet wines of ultimate perfection.This wine shows a golden color with a delicious aroma of apricot and honey. On the palate this wine is fresh and creamy with a lively finish.  "},{"name":"Kracher Welschriesling TBA Zwischen den Seen No. 4 (375ML) 2011","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":93.0,"notes":"Attractive aromas of quince and ripe yellow apple, with a taste honeydew melon and white peach. The finish has mineral characters and a pleasant salty touch."},{"name":"Kracher Welschriesling Trockenbeerenauslese No. 11 (375ML half-bottle) 2002","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":98.0,"notes":"Rich golden-yellow tone. Intense aromas of herbed spice, a touch of smoke over nougat, subtle fig, apricot and honey. The palate is luscious and succulent with fruit-driven flavors of orange; intense and elegant, with complexity and concentration of fruit. Despite the spectrum of the technical data, the wine is exceptionally harmonious, with long development potential."},{"name":"Kracher Welschriesling Trockenbeerenauslese No. 11 (375ML half-bottle) 2010","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":93.0,"notes":"Rich golden-yellow tone. Intense aromas of herbed spice, a touch of smoke over nougat, subtle fig, apricot and honey. The palate is luscious and succulent with fruit-driven flavors of orange; intense and elegant, with complexity and concentration of fruit. Despite the spectrum of the technical data, the wine is exceptionally harmonious, with long development potential."},{"name":"Kracher Welschriesling Trockenbeerenauslese No. 7 (375ML) 2007","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":93.0,"notes":"This medium golden yellow wine makes an impressively clear statement. Aromas and flavors of Cox’s orange pippin and pear are clearly defined. Verbena, prune and subtle sponge cake also flavor the nearly chocolaty texture. The wine is very juicy and round with a good core of acid and plenty of chalky minerals. This wine has a long and very promising life ahead of it."},{"name":"Kracher Welschriesling Trockenbeerenauslese No. 7 (375ML) 2010","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Medium golden yellow. Attractive aromas of fresh meadow herbs over yellow fruit characters and a touch of honey. Succulent, luscious, with highly ripe yellow tropical fruit characters coupled with an artful acidity structure. Fruit sensation lingers on the palate, leading to a delicate aftertaste. Long development potential"},{"name":"Kracher Welschriesling Trockenbeerenauslese No. 7 (375ML) 2012","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":94.0,"notes":"Attractive aromas of ripe stone fruit, apricot jam, nuts and fresh herbs. Silky texture and highly balanced acidity with pleasant floral notes on the finish with an elegant, salty tang."},{"name":"Kracher Welschriesling Z D S Trockenbeerenauslese #8 2000","grape":null,"region":"Burgenland, Austria","variety":"Collectible","rating":95.0,"notes":"Sweet oak, botrytis, and jellied apricots emanate from the glass of the 2000 #9 Scheurebe Trockenbeerenauslese Zwischen den Seen. A diabetic’s nightmare (6.5% alcohol, 347.8 grams residual sugar\/liter, and 7.6 grams\/liter total acidity), this full-bodied wine slathers itself onto the palate, revealing syrupy layers of jellied peaches and spiced dried apricots. It has unbelievable power,density, and length. Projected maturity: now-2045."},{"name":"Kracher Zweigelt TBA Nouvelle Vogue No. 2 (375ML) 2013","grape":null,"region":"Burgenland, Austria","variety":null,"rating":93.0,"notes":"Dark ruby in color with a lovely aromas of subtle citrus and orange zest, fine red berry notes and a delicate touch of tobacco. On the palate fresh cherries, delicate gingerbread notes of allspice and anise. Beautiful acidity on the finish."},{"name":"Kracher Zweigelt TBA Nouvelle Vogue No. 5 (375ML) 2010","grape":null,"region":"Burgenland, Austria","variety":null,"rating":90.0,"notes":"Pale cherry red color with orange reflections. Bouquet of fine sweet plum characters, coupled with a touch of dark greengage fruit notes and subtle herbed spices. The palate displays flavors of red fruit of the forest berry pudding, with a rich and elegant character, that lead to notes of potted cherries and a touch of orange. Fresh and well balanced with a lingering finish."},{"name":"Kurt Angerer Kies Gruner Veltliner 2007","grape":null,"region":"Austria","variety":"White Wine","rating":92.0,"notes":"Rich and filled with peach, apricot and golden raisin flavors. The long finish features plenty of spice and cream. "},{"name":"Laurenz V Charming Gruner Veltliner 2006","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"The Laurenz V. Charming Grüner Veltliner has aromas of ripe apples and a typical Veltliner spiciness that marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking."},{"name":"Laurenz V Charming Gruner Veltliner 2010","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming!"},{"name":"Laurenz V Charming Gruner Veltliner 2009","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming! "},{"name":"Laurenz V Charming Gruner Veltliner 2011","grape":null,"region":"Austria","variety":"White Wine","rating":89.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming!"},{"name":"Laurenz V Charming Gruner Veltliner 2012","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming!"},{"name":"Laurenz V Charming Gruner Veltliner 2013","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming!"},{"name":"Laurenz V Charming Gruner Veltliner 2014","grape":null,"region":"Kamptal, Austria","variety":"White Wine","rating":90.0,"notes":"Aromas of ripe apples and a typical Veltliner spiciness marry to create a fascinating fruit bouquet. On the palate, the wine is soft and juicy, supported by a fine fruit acidity. Very harmonious, allowing for perfectly smooth drinking. Simply charming!"},{"name":"Laurenz V Singing Gruner Veltliner 2007","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!"},{"name":"Laurenz V Singing Gruner Veltliner 2010","grape":null,"region":"Austria","variety":"White Wine","rating":88.0,"notes":"A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!"},{"name":"Laurenz V Singing Gruner Veltliner 2011","grape":null,"region":"Austria","variety":"White Wine","rating":88.0,"notes":"A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!"},{"name":"Laurenz V Singing Gruner Veltliner 2013","grape":null,"region":"Austria","variety":"White Wine","rating":89.0,"notes":"A very attractive fruit bouquet yields apple, peach and citrus aromas along with a typical Veltliner spiciness and a touch of white pepper. The soft and juicy palate is supported by fine acidity. It sings on the palate!"},{"name":"Leth Steinagrund Gruner Veltliner 2007","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces."},{"name":"Leth Steinagrund Gruner Veltliner 2008","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces."},{"name":"Leth Steinagrund Gruner Veltliner 2010","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces. This wine is part of a line from Leth that displays complexity in flavor, minerality and durability."},{"name":"Leth Steinagrund Gruner Veltliner 2012","grape":null,"region":"Austria","variety":"White Wine","rating":88.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces. This wine is part of a line from Leth that displays complexity in flavor, minerality and durability."},{"name":"Leth Steinagrund Gruner Veltliner 2015","grape":null,"region":"Austria","variety":"White Wine","rating":91.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces. This wine is part of a line from Leth that displays complexity in flavor, minerality and durability."},{"name":"Leth Steinagrund Gruner Veltliner 2016","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces. This wine is part of a line from Leth that displays complexity in flavor, minerality and durability."},{"name":"Leth Steinagrund Gruner Veltliner 2017","grape":null,"region":"Austria","variety":"White Wine","rating":90.0,"notes":"The nose combines spice with a reductive fruit; the palate displays peppery notes; a classic Veltliner from loess terraces. This wine is part of a line from Leth that displays complexity in flavor, minerality and durability."}]